app/views/mechanics/_times.html.erb

						      <div class="card-block">
						        <%=has_job[0].user.first_name %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]