app/views/mechanics/index.html.erb

SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
		<%if job.appointment_id != nil %>
			<%appointment = Appointment.find(job.appointment_id)%>