app/controllers/appointments_controller.rb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."mechanic_id" = ? AND ("appointments"."date" BETWEEN ? AND ?)  [["mechanic_id", 1], ["date", Tue, 14 Mar 2017], ["date", Wed, 15 Mar 2017]]
---
  def new
    @date = params[:date]
    respond_to do |format|
      @appointments = current_mechanic.appointments.where(date: params[:date])

INSERT INTO "appointments" ("date", "created_at", "updated_at", "mechanic_id") VALUES (?, ?, ?, ?)  [["date", 2017-03-22 20:00:00 UTC], ["created_at", 2017-03-21 05:40:07 UTC], ["updated_at", 2017-03-21 05:40:07 UTC], ["mechanic_id", 1]]
---
  def create
    respond_to do |format|
  	  @appointment = Appointment.create(date: params[:date], hour: params[:hour], mechanic_id: current_mechanic.id)

SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
DELETE FROM "appointments" WHERE "appointments"."id" = ?  [["id", 18]]
---
  def destroy
    @appointment = Appointment.find(params[:id])
    respond_to do |format|
      if @appointment.destroy