app/controllers/calendars_controller.rb

  def show
  	respond_to do |format|
  		date = params[:date].to_date
  		@taken_jobs = Job.where.not(appointment_id: nil)
		@mechanic = Mechanic.find(params[:mechanic])
		@appointments = @mechanic.appointments.where(date: date..date + 1.day).all
---
SELECT  "mechanics".* FROM "mechanics" WHERE "mechanics"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "appointments".* FROM "appointments" WHERE "appointments"."mechanic_id" = ? AND ("appointments"."date" BETWEEN ? AND ?)  [["mechanic_id", 2], ["date", Wed, 22 Mar 2017], ["date", Thu, 23 Mar 2017]]