app/controllers/jobs_controller.rb

SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def create
  	@vehicle = Vehicle.find(params[:vehicle_id])