app/controllers/users_controller.rb

  def show
  	@new_vehicle = Vehicle.new
  	@new_job = Job.where(user_id: current_user.id).where(customer_description: nil).last
  	@user = current_user
    @mechanics = Mechanic.where.not(latitude: nil).where.not(longitude: nil)
---
SELECT "mechanics".* FROM "mechanics" WHERE ("mechanics"."latitude" IS NOT NULL) AND ("mechanics"."longitude" IS NOT NULL)