app/controllers/vehicles_controller.rb

  def create
  	@vehicle = Vehicle.new(vehicle_params)
  	if @vehicle.save
---
INSERT INTO "vehicles" ("user_id", "make", "model", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 5], ["make", "ford"], ["model", "f150"], ["created_at", 2017-03-07 04:21:01 UTC], ["updated_at", 2017-03-07 04:21:01 UTC]]